old_projects/Centrobeznay_neust/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    movingWalls
    {
        type rotatingWallVelocity;
	origin (0 0 0);
	axis (0 0 1);
	omega 10.335;
    }

    fixedWalls
    {
        type rotatingWallVelocity;
	origin (0 0 0);
	axis (0 0 1);
	omega -8;
    }

    potolok
    {
        type cyclic;
    }
    pol
    {
        type cyclic;
    }
}

// ************************************************************************* //
