old_projects/Centrobeznay_neust/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    fixedWalls
    {
        type            zeroGradient;
    }
	movingWalls
    {
        type            zeroGradient;
    }
    potolok
    {
        type cyclic;
    }
    pol
    {
        type cyclic;
    }
}

// ************************************************************************* //
