old_projects/Centrobeznay_neust/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    fixedWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3200;
        startFace       187200;
    }
    movingWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3200;
        startFace       190400;
    }
    potolok
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          1600;
        startFace       193600;
        matchTolerance  0.0001;
        neighbourPatch  pol;
        transformType   translational;
        separation      (0 0 0.02273);
    }
    pol
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          1600;
        startFace       195200;
        matchTolerance  0.0001;
        neighbourPatch  potolok;
        transformType   translational;
        separation      (0 0 -0.02273);
    }
)

// ************************************************************************* //
