old_projects/Centrobeznay_neust/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (4.035 0 0)  //0
    (0 4.035 0)  //1
    (-4.035 0 0)  //2
    (0 -4.035 0)  //3
    (3.55 0 0)  //4
    (0 3.55 0)  //5
    (-3.55 0 0)  //6
    (0 -3.55 0)  //7
    (4.035 0 2.273)  //8
    (0 4.035 2.273)  //9
    (-4.035 0 2.273)  //10
    (0 -4.035 2.273)  //11
    (3.55 0 2.273)  //12
    (0 3.55 2.273)  //13
    (-3.55 0 2.273)  //14
    (0 -3.55 2.273)  //15
    
);

blocks
(
    hex (0 1 5 4 8 9 13 12) (20 20 40) simpleGrading (1 1 1)
    hex (1 2 6 5 9 10 14 13) (20 20 40) simpleGrading (1 1 1)
    hex (2 3 7 6 10 11 15 14) (20 20 40) simpleGrading (1 1 1)
    hex (3 0 4 7 11 8 12 15) (20 20 40) simpleGrading (1 1 1)
);

edges
(
arc 0 1 (2.853 2.853 0)
arc 1 2 (-2.853 2.853 0)
arc 2 3 (-2.853 -2.853 0)
arc 3 0 (2.853 -2.853 0)

arc 4 5 (2.51 2.51 0)
arc 5 6 (-2.51 2.51 0)
arc 6 7 (-2.51 -2.51 0)
arc 7 4 (2.51 -2.51 0)

arc 8 9 (2.853 2.853 2.273)
arc 9 10 (-2.853 2.853 2.273)
arc 10 11 (-2.853 -2.853 2.273)
arc 11 8 (2.853 -2.853 2.273)

arc 12 13 (2.51 2.51 2.273)
arc 13 14 (-2.51 2.51 2.273)
arc 14 15 (-2.51 -2.51 2.273)
arc 15 12 (2.51 -2.51 2.273)
);

boundary
(
    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
            (3 0 8 11)
        );
    }
	movingWalls
    {
        type wall;
        faces
        (
            (13 12 4 5)
            (14 13 5 6)
            (15 14 6 7)
            (12 15 7 4)
        );
    }
    potolok
    {
        type cyclic;
	neighbourPatch pol;
        faces
        (
            (8 9 13 12)
	    (9 10 14 13)
            (10 11 15 14)
	    (11 8 12 15)
        );
    }
    pol
    {
        type cyclic;
	neighbourPatch potolok;
        faces
        (
            (0 4 5 1)
	    (1 5 6 2)
            (2 6 7 3)
	    (3 7 4 0)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
